RhinoInside.Revit API Documentation
GeometryDecoder.ToPoint Method
 Converts the specified Point to an equivalent Rhino Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Point ToPoint(
	this Autodesk.Revit.DB.Point value
)
@staticmethod
def ToPoint(
	value: Autodesk.Revit.DB.Point
) -> Rhino.Geometry.Point
Parameters
value
Type: Autodesk.Revit.DB.Point
A value to convert.
Return Value
Type: Rhino.Geometry.Point
A Rhino Point that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace